/* $Id: UnattendedImpl.cpp $ */
/** @file
 * Unattended class implementation
 */

/*
 * Copyright (C) 2006-2023 Oracle and/or its affiliates.
 *
 * This file is part of VirtualBox base platform packages, as
 * available from https://www.virtualbox.org.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation, in version 3 of the
 * License.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, see <https://www.gnu.org/licenses>.
 *
 * SPDX-License-Identifier: GPL-3.0-only
 */


/*********************************************************************************************************************************
*   Header Files                                                                                                                 *
*********************************************************************************************************************************/
#define LOG_GROUP LOG_GROUP_MAIN_UNATTENDED
#include "LoggingNew.h"
#include "VirtualBoxBase.h"
#include "UnattendedImpl.h"
#include "UnattendedInstaller.h"
#include "UnattendedScript.h"
#include "VirtualBoxImpl.h"
#include "SystemPropertiesImpl.h"
#include "MachineImpl.h"
#include "Global.h"
#include "StringifyEnums.h"

#include <VBox/err.h>
#include <iprt/cpp/xml.h>
#include <iprt/ctype.h>
#include <iprt/file.h>
#ifndef RT_OS_WINDOWS
# include <iprt/formats/mz.h>
# include <iprt/formats/pecoff.h>
#endif
#include <iprt/formats/wim.h>
#include <iprt/fsvfs.h>
#include <iprt/inifile.h>
#include <iprt/locale.h>
#include <iprt/path.h>
#include <iprt/vfs.h>

using namespace std;


/*********************************************************************************************************************************
*   Structures and Typedefs                                                                                                      *
*********************************************************************************************************************************/
/**
 * Controller slot for a DVD drive.
 *
 * The slot can be free and needing a drive to be attached along with the ISO
 * image, or it may already be there and only need mounting the ISO.  The
 * ControllerSlot::fFree member indicates which it is.
 */
struct ControllerSlot
{
    StorageBus_T    enmBus;
    Utf8Str         strControllerName;
    LONG            iPort;
    LONG            iDevice;
    bool            fFree;

    ControllerSlot(StorageBus_T a_enmBus, const Utf8Str &a_rName, LONG a_iPort, LONG a_iDevice, bool a_fFree)
        : enmBus(a_enmBus), strControllerName(a_rName), iPort(a_iPort), iDevice(a_iDevice), fFree(a_fFree)
    {}

    bool operator<(const ControllerSlot &rThat) const
    {
        if (enmBus == rThat.enmBus)
        {
            if (strControllerName == rThat.strControllerName)
            {
                if (iPort == rThat.iPort)
                    return iDevice < rThat.iDevice;
                return iPort < rThat.iPort;
            }
            return strControllerName < rThat.strControllerName;
        }

        /*
         * Bus comparsion in boot priority order.
         */
        /* IDE first. */
        if (enmBus == StorageBus_IDE)
            return true;
        if (rThat.enmBus == StorageBus_IDE)
            return false;
        /* SATA next */
        if (enmBus == StorageBus_SATA)
            return true;
        if (rThat.enmBus == StorageBus_SATA)
            return false;
        /* SCSI next */
        if (enmBus == StorageBus_SCSI)
            return true;
        if (rThat.enmBus == StorageBus_SCSI)
            return false;
        /* numerical */
        return (int)enmBus < (int)rThat.enmBus;
    }

    bool operator==(const ControllerSlot &rThat) const
    {
        return enmBus            == rThat.enmBus
            && strControllerName == rThat.strControllerName
            && iPort             == rThat.iPort
            && iDevice           == rThat.iDevice;
    }
};

/**
 * Installation disk.
 *
 * Used when reconfiguring the VM.
 */
typedef struct UnattendedInstallationDisk
{
    StorageBus_T    enmBusType;         /**< @todo nobody is using this... */
    Utf8Str         strControllerName;
    DeviceType_T    enmDeviceType;
    AccessMode_T    enmAccessType;
    LONG            iPort;
    LONG            iDevice;
    bool            fMountOnly;
    Utf8Str         strImagePath;
    bool            fAuxiliary;

    UnattendedInstallationDisk(StorageBus_T a_enmBusType, Utf8Str const &a_rBusName, DeviceType_T a_enmDeviceType,
                               AccessMode_T a_enmAccessType, LONG a_iPort, LONG a_iDevice, bool a_fMountOnly,
                               Utf8Str const &a_rImagePath, bool a_fAuxiliary)
        : enmBusType(a_enmBusType), strControllerName(a_rBusName), enmDeviceType(a_enmDeviceType), enmAccessType(a_enmAccessType)
        , iPort(a_iPort), iDevice(a_iDevice), fMountOnly(a_fMountOnly), strImagePath(a_rImagePath), fAuxiliary(a_fAuxiliary)
    {
        Assert(strControllerName.length() > 0);
    }

    UnattendedInstallationDisk(std::list<ControllerSlot>::const_iterator const &itDvdSlot, Utf8Str const &a_rImagePath,
                               bool a_fAuxiliary)
        : enmBusType(itDvdSlot->enmBus), strControllerName(itDvdSlot->strControllerName), enmDeviceType(DeviceType_DVD)
        , enmAccessType(AccessMode_ReadOnly), iPort(itDvdSlot->iPort), iDevice(itDvdSlot->iDevice)
        , fMountOnly(!itDvdSlot->fFree), strImagePath(a_rImagePath), fAuxiliary(a_fAuxiliary)
    {
        Assert(strControllerName.length() > 0);
    }
} UnattendedInstallationDisk;


/**
 * OS/2 syslevel file header.
 */
#pragma pack(1)
typedef struct OS2SYSLEVELHDR
{
    uint16_t    uMinusOne;          /**< 0x00: UINT16_MAX */
    char        achSignature[8];    /**< 0x02: "SYSLEVEL" */
    uint8_t     abReserved1[5];     /**< 0x0a: Usually zero. Ignore.  */
    uint16_t    uSyslevelFileVer;   /**< 0x0f: The syslevel file version: 1. */
    uint8_t     abReserved2[16];    /**< 0x11: Zero. Ignore.  */
    uint32_t    offTable;           /**< 0x21: Offset of the syslevel table. */
} OS2SYSLEVELHDR;
#pragma pack()
AssertCompileSize(OS2SYSLEVELHDR, 0x25);

/**
 * OS/2 syslevel table entry.
 */
#pragma pack(1)
typedef struct OS2SYSLEVELENTRY
{
    uint16_t    id;                 /**< 0x00: ? */
    uint8_t     bEdition;           /**< 0x02: The OS/2 edition: 0=standard, 1=extended, x=component defined */
    uint8_t     bVersion;           /**< 0x03: 0x45 = 4.5 */
    uint8_t     bModify;            /**< 0x04: Lower nibble is added to bVersion, so 0x45 0x02 => 4.52 */
    uint8_t     abReserved1[2];     /**< 0x05: Zero. Ignore. */
    char        achCsdLevel[8];     /**< 0x07: The current CSD level. */
    char        achCsdPrior[8];     /**< 0x0f: The prior CSD level. */
    char        szName[80];         /**< 0x5f: System/component name. */
    char        achId[9];           /**< 0x67: System/component ID. */
    uint8_t     bRefresh;           /**< 0x70: Single digit refresh version, ignored if zero. */
    char        szType[9];          /**< 0x71: Some kind of type string. Optional */
    uint8_t     abReserved2[6];     /**< 0x7a: Zero. Ignore. */
} OS2SYSLEVELENTRY;
#pragma pack()
AssertCompileSize(OS2SYSLEVELENTRY, 0x80);



/**
 * Concatenate image name and version strings and return.
 *
 * A possible output would be "Windows 10 Home (10.0.19041.330 / x64)".
 *
 * @returns Name string to use.
 * @param   r_strName   String object that can be formatted into and returned.
 */
const Utf8Str &WIMImage::formatName(Utf8Str &r_strName) const
{
    /* We skip the mFlavor as it's typically part of the description already. */

    if (mVersion.isEmpty() && mArch.isEmpty() && mDefaultLanguage.isEmpty() && mLanguages.size() == 0)
        return mName;

    r_strName = mName;
    bool fFirst = true;
    if (mVersion.isNotEmpty())
    {
        r_strName.appendPrintf(fFirst ? " (%s" : " / %s", mVersion.c_str());
        fFirst = false;
    }
    if (mArch.isNotEmpty())
    {
        r_strName.appendPrintf(fFirst ? " (%s" : " / %s", mArch.c_str());
        fFirst = false;
